/**
* указываем на то, что класс принадлежит пакету 
*/
package Calc;

/**
* описываем класс для расчёта объёма видеопамяти 
*/
public class physhicalCalc {
	/**
* Создаем метод для расчёта памяти для корпоративных клиентов 
*/
	public String getK(int t, int k, int d, double m){ 
		/**
*переменная, которая будет возвращена в методе 
*/
		double V = 0; 
		/**
* Иницилизация перемнной строкового типа для вывода результата 
*/
		String str;
		
		/**
* Считаем необходимый объём видеопамяти 
*/
		V = (m*t*3600*d*k)/1024 ; 
		/**
*Округление до сотых 
*/
		V = V * 100; 
		/**
*Округление до сотых 
*/
		int i = (int) Math.round(V); 
	 	/**
*Округление до сотых 
*/
		V = (double)i / 100; 
		 /**
* Конвертирование ежемесячерно платежа из типа double в String(для вывода)  
*/
			str = Double.toString(V); 
			/**
* возвращаем методу результат 
*/
		return str; 
	}
}
